<?php
// Регулярні вирази
$patterns = [
  'name' => [
    'regex' => '/^[а-яА-ЯёЁіІїЇєЄ\-\s]+$|^[a-zA-Z\-\s\']+$/u'
  ],
  'position' => [
    'regex' => '/^.*$/u'
  ],
  'phone' => [
    'regex' => '/^\+?3?8?0?(\d{9})$/', // загальний регулярний вираз
    'replacement' => '/^\+?3?8?0?/', // заміна
    'callback' => function ()
    {
      return "+380"; // додаток до номера
    }
  ],
  'email' => ['/^[a-zA-Z\d\W]+@[a-zA-Z\d\W]+$/'],
  'iban' => ['/^[a-zA-Z]{2}\s?[0-9]{2}\s?(?:[a-zA-Z0-9]\s?){4}(?:[0-9]\s?){7}\s?(?:[a-zA-Z0-9]?\s?){0,16}$/'] // перевіряє iban
];
// EOF